## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_cdn_profile.cdn-mta-sts will be created
  + resource "azurerm_cdn_profile" "cdn-mta-sts" {
      + id                  = (known after apply)
      + location            = "global"
      + name                = "cdn-mjwmtasts"
      + resource_group_name = "rg-whitefam-cdnprofiles"
      + sku                 = "Standard_Microsoft"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
    }

  # azurerm_dns_zone.tftest-mjw will be created
  + resource "azurerm_dns_zone" "tftest-mjw" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "tfttest.matthewjwhite.co.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-whitefam-dnszones"
      + tags                      = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-whitefam-dnszones"
      + tags                                                  = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + soa_record (known after apply)
    }

  # azurerm_resource_group.cdnprofiles will be created
  + resource "azurerm_resource_group" "cdnprofiles" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-whitefam-cdnprofiles"
      + tags     = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
    }

  # azurerm_resource_group.dnszones will be created
  + resource "azurerm_resource_group" "dnszones" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "rg-whitefam-dnszones"
      + tags     = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
    }

  # azurerm_resource_group.rg-ak2s2 will be destroyed
  # (because azurerm_resource_group.rg-ak2s2 is not in configuration)
  - resource "azurerm_resource_group" "rg-ak2s2" {
      - id         = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-dave-testgruop" -> null
      - location   = "uksouth" -> null
      - name       = "rg-dave-testgruop" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.rg-aks2 will be destroyed
  # (because azurerm_resource_group.rg-aks2 is not in configuration)
  - resource "azurerm_resource_group" "rg-aks2" {
      - id         = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-terraform-github-actions" -> null
      - location   = "uksouth" -> null
      - name       = "rg-terraform-github-actions" -> null
        # (1 unchanged attribute hidden)
    }

  # module.bs-co-records.azurerm_dns_a_record.a["@"] will be created
  + resource "azurerm_dns_a_record" "a" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "198.185.159.144",
          + "198.185.159.145",
          + "198.49.23.144",
          + "198.49.23.145",
        ]
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_caa_record.caa["@"] will be created
  + resource "azurerm_dns_caa_record" "caa" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + flags = 0
          + tag   = "iodef"
          + value = "mailto:dnscaa@matthewjwhite.co.uk"
        }
      + record {
          + flags = 0
          + tag   = "issue"
          + value = "digicert.com"
        }
      + record {
          + flags = 0
          + tag   = "issue"
          + value = "letsencrypt.org"
        }
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["autodiscover"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "autodiscover"
      + record              = "autodiscover.outlook.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["enterpriseenrollment"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseenrollment"
      + record              = "enterpriseenrollment.manage.microsoft.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["enterpriseregistration"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "enterpriseregistration"
      + record              = "enterpriseregistration.windows.net"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["nhty6l3pj4xw4kj6tybz"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nhty6l3pj4xw4kj6tybz"
      + record              = "verify.squarespace.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["selector1._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector1._domainkey"
      + record              = "selector1-tftest-mjw._domainkey.objectatelier.onmicrosoft.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["selector2._domainkey"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "selector2._domainkey"
      + record              = "selector2-tftest-mjw._domainkey.objectatelier.onmicrosoft.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_cname_record.cname["www"] will be created
  + resource "azurerm_dns_cname_record" "cname" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "ext-cust.squarespace.com"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.bs-co-records.azurerm_dns_mx_record.mx["@"] will be created
  + resource "azurerm_dns_mx_record" "mx" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + exchange   = "tftest-mjw.mail.protection.outlook.com"
          + preference = "0"
        }
    }

  # module.bs-co-records.azurerm_dns_txt_record.txt["@"] will be created
  + resource "azurerm_dns_txt_record" "txt" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 3600
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + value = "MS=ms59722365"
        }
      + record {
          + value = "v=spf1 include:spf.protection.outlook.com -all"
        }
    }

Plan: 16 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + privatezone-keyvault-id   = (known after apply)
  + privatezone-keyvault-name = "privatelink.vaultcore.azure.net"
  + rg-dnszones               = "rg-whitefam-dnszones"
```
</details>